Revit 2022 API
ExternalDefinitionCreationOptions Constructor (String, ForgeTypeId)
 Constructs the options using a specified name and type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
public ExternalDefinitionCreationOptions(
	string name,
	ForgeTypeId dataType
)
Visual Basic
Public Sub New ( _
	name As String, _
	dataType As ForgeTypeId _
)
Visual C++
public:
ExternalDefinitionCreationOptions(
	String^ name,
	ForgeTypeId^ dataType
)
Parameters
name
Type: System.String
 The name of the parameter definition to be created.
dataType
Type: Autodesk.Revit.DB.ForgeTypeId
 The identifier of either a spec or a category. A category identifier indicates a Family Type parameter of that category.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given identifier is neither a spec nor a category.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalDefinitionCreationOptions Class
ExternalDefinitionCreationOptions Overload
Autodesk.Revit.DB Namespace